[
  {
    "Timestamp": "4/22/2024 12:07:58",
    "Share a memory of George or a message to his family": "George and Cathy, came to my home in Bolivia, NC.  We had a wonderful visit, doing some sight seeing, relaxing, and talking.  George and I suggested watching an old movie one night.  It was Foul Play and we laughed and laughed together.  It was a special and blessed time that I will cherish always.  A picture of that visit is on my digital picture frame.  My love and prayers to my dear friend, Cathy, and to Geoffrey, and Tim.  I am so sorry for your loss, and wish I could be there to help you as you helped me through my loss in 2007.  I love you!",
    "Your name": "Lynn Seavy",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/29/2024 22:04:55",
    "Share a memory of George or a message to his family": " wow George will certainly be missed..he was always there to help me at Recycling bike shop whenever I had a problem with a bike that I was working on.  My sincere condolences to the family.  He was a true friend.",
    "Your name": "Nannette Swanson",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/30/2024 13:39:29",
    "Share a memory of George or a message to his family": "My early memories of Uncle George were that he was that guy who took us to museums. Every time we saw him, we went to a museum. Or a zoo (memorably, to see the pandas in Columbus in 1988). \n\nLater, I knew him as a lover of bikes. He was the first person I knew who commuted to work on a bike. I remember the little mirror attached to his helmet, which 8-year-old me thought was so cool. \n\nRight before Covid struck, I was planning with him to make a trip out to Portland so he could experience that city’s great bike infrastructure. I was coordinating with friends who ran an AirBnB for him and Aunt Cathy to stay in. Sadly that trip never happened. Ironically, I later moved into that very same AirBnB, where I met my wife. \n\nHis sudden passing saddens me greatly. Particularly as my newborn daughter will not have the chance to catch the spark of his love of knowledge or bikes. Uncle George, you will be missed. ",
    "Your name": "Eric Wagner",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "5/8/2024 16:01:32",
    "Share a memory of George or a message to his family": "George was my brother in law. I'm Cathy's brother. George got me interested in bicycling. I bought my first ten speed bike from him. It was a green Schwinn Varsity. A really nice bike.",
    "Your name": "Christopher Schaumberg ",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "04/15/2024 0:00:00",
    "Share a memory of George or a message to his family": "My deepest sympathy to George’s loved ones.  He was a wonderful person..it was a pleasure to know him when I worked at the Fairgrounds…he will be missed.",
    "Your name": "Betsy S",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/12/2024 0:00:00",
    "Share a memory of George or a message to his family": "We first met George when he and I were both bike commuting to the same organization in Cleveland in the early 2000’s. I am not a bike addict, but  it did not take long for George and my husband to discover their shared mania for wrenching and sprocket talk. Since we lived on his route home, he became a part of our extended family, dropping in for visits, conversation, and dinner. We both moved on from those jobs, but stayed in touch, providing mutual stopovers (and bike swaps) on his route from Pennsylvania to Michigan and our route from Ohio to New York to visit our children. George’s love of bikes provided a lens for his character: his work at the bike coop manifested his compassion for necessity cyclists, and his advice for our bike shop showed his commitment to excellence.  I am so grateful for the way that my husband’s bike obsession brought George into our lives!",
    "Your name": "Nozomi Ikuta",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/12/2024 0:00:00",
    "Share a memory of George or a message to his family": "George has been my friend for 25 years. Certainly, we were both crazy about bicycles, but that was just the thread that provoked us to drop by/phone/email. George was the more often the one who reached out, a blessing for which I am deeply grateful. I so enjoyed our shared times.\n\nGeorge was fascinated with and fascinating on a diversity of interests. We endlessly discussed history, politics, religion, education, science, mechanics, cultures, modern society, values, morality. To know George was to be challenged to think deeply and continuously, with humor and humility. My only regret is that I did not get together with him more often.",
    "Your name": "James Watson",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/11/2024 0:00:00",
    "Share a memory of George or a message to his family": "I worked at Big Spring with George. I would give him old toothbrushes for his bike work.  He would bike to Big Spring!\nEnjoyed him and his brain.\nMy deepest sympathy.  Ride On George!",
    "Your name": "Mary Beth Miller",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/11/2024 0:00:00",
    "Share a memory of George or a message to his family": "George was a great guy. He really made Saturday mornings at the bike shop a favorite part of my week. He helped a lot of people. My condolences to his family and friends.",
    "Your name": "Brian Palmer",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  },
  {
    "Timestamp": "4/10/2024 0:00:00",
    "Share a memory of George or a message to his family": "A great man and a true friend.\nI will miss our conversations on everything bicycle related.\n\n\"The right kinds of friendship lead one to virtue.\"",
    "Your name": "Greg C.",
    "Can we share your memory on this website?": "Please allow others to view my memory on the memorial website"
  }
]
